In [ ]:
import yfinance as yf
import pandas as pd

all_data = {ticker:yf.download(ticker) for ticker in ['2330.TW','2303.TW','2454.TW','2317.TW']}
all_data

In [2]:
new_data = {key:df[('Close', key)] for key,df in all_data.items()}
df = pd.DataFrame(new_data)
df1 = df.rename(columns={
    '2330.TW':'台積電',
    '2303.TW':'聯電',
    '2454.TW':'聯發科',
    '2317.TW':'鴻海'})

In [3]:
df2 = df1.dropna()

In [4]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 5816 entries, 2001-07-23 to 2024-12-20
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   台積電     5816 non-null   float64
 1   聯電      5816 non-null   float64
 2   聯發科     5816 non-null   float64
 3   鴻海      5816 non-null   float64
dtypes: float64(4)
memory usage: 227.2 KB

In [ ]:
df2

In [6]:
df3 = df2.pct_change().dropna()

In [7]:
df3.corr()

          台積電        聯電       聯發科        鴻海
台積電  1.000000  0.599553  0.434852  0.487110
聯電   0.599553  1.000000  0.377422  0.424851
聯發科  0.434852  0.377422  1.000000  0.372213
鴻海   0.487110  0.424851  0.372213  1.000000

In [8]:
(df2 - df2.shift(1)).dropna()

                  台積電        聯電        聯發科        鴻海
Date
2001-07-24  -0.171686 -0.032131   1.789721 -0.304308
2001-07-25   0.514736  0.289206   2.074514  0.406414
2001-07-26   0.514727  0.321337   2.165535  0.506495
2001-07-27   1.029467  0.257076  -0.094818 -0.304299
2001-07-30   0.000000  0.000000   0.000000  0.000000
...               ...       ...        ...       ...
2024-12-16  20.000000  0.000000 -25.000000 -4.500000
2024-12-17 -10.000000  1.099998  40.000000  1.000000
2024-12-18  10.000000  1.150002  -5.000000  1.500000
2024-12-19 -15.000000 -0.700001   0.000000 -3.500000
2024-12-20 -35.000000 -0.650002 -30.000000  0.000000

[5815 rows x 4 columns]